// 4 урок.
// Задача 25: Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
// 3, 5 -> 243 (3⁵)

// 2, 4 -> 16

// int A=Convert.ToInt32(Console.ReadLine());
// int B=Convert.ToInt32(Console.ReadLine());
// Console.WriteLine(Math.Pow(A,B));


// Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.

// 452 -> 11

// 82 -> 10

// 9012 -> 12

// int n=Convert.ToInt32 (Console.ReadLine ());
// int s=0;
// while (n!=0)
// {
// s=s+n%10;
// n=n/10;
// }
// System.Console.WriteLine(s);




// Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.

// 1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]

// 6, 1, 33 -> [6, 1, 33]

//  int[] a=new int[8];

// Random random=new Random();
// for(int i=0;i<a.Length;i++)
//    {
//       a[i]=random.Next(1,10);
//    Console.Write(a[i]);
   
//    }


