// 8. Вывести на экран числа от -N до N
int N;
N=Convert.ToInt32(Console.ReadLine());
int i=-N;
// нц пока i<=N
// кц

while(i<=N)
{
    System.Console.WriteLine(i);
    i++;
}
